package javabaseclasslibrary;

/**
 * TODO
 * 正则表达式
 * @author ambereye
 * @date 2019/7/25
 */
public class regularExpressionDemo {
    /**
     * 1 字符匹配
     *  \\     \
     *  \n     换行
     *  \t    匹配制表符
     * 2 字符集
     *  [abc]  是abc中的
     *  [^abc] 不是abc中的
     *  [a-zA-Z] 任意字符不区分大写小
     *  [0-9]
     * 3 简化字符集
     *  .   任意字符
     *  \d  等价于0-9
     *  \D  [^0-9]
     *  \s  匹配任意一位空格 换行制表符
     *  \S  非空格数据
     *  \w  匹配字符数字下划线[a-zA-Z_0-9]
     *  \W  [^a-zA-Z_0-9]
     *  4 边界匹配
     *  ^   边界开始
     *  $   边界结束
     *  5 数量表示-----------------------  \\w+
     *  表达式?:出现0次或1次
     *  表达式*:出现0次或1次或多次
     *  表达式+:出现\1次或多次
     *  表达式{n}:出现n次
     *  表达式{n,}:出现n次以上
     *  表达式{n,m}:出现n到m次
     *  6 逻辑
     *
     *
     */
}
